improve images and fix theory docs
